# -*- coding: utf-8 -*-
"""
Задание 5.4a

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0 255.255.255.0

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Пример работы задания:

$ python task_5_4a.py
Введите адрес сети: 10.1.1.0 255.255.255.0

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


$ python task_5_4a.py
Введите адрес сети: 10.1.1.192 255.255.255.240

Network:
10        1         1         192
00001010  00000001  00000001  11000000

Mask:
/28
255       255       255       240
11111111  11111111  11111111  11110000
"""

ip = input("Введите IP-адрес: ").replace(" ", ".")
octets = ip.split(".")

output = """
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {0:08b}  {0:08b}  {0:08b}
"""

print("Network:\n", output.format(int(octets[0]), int(octets[1]), int(octets[2]), int(octets[3])))
print("Mask:\n", output.format(int(octets[4]), int(octets[5]), int(octets[6]), int(octets[7])))
